> Thanks for the reply @S1M0NM! Could you share more details about
> 
> > However, the terraform apply step also runs without any problems, since the old version is first deleted and then the new version is created.
> 
> Like I wouldn't expect any deletions in the example you shared. There's v1 schema and then you create v2 schema via `terraform apply`.

Of course! I created a module to save as much work as possible for our developers and to avoid possible copy-paste errors.
So the developers only need to edit the entries in the schemas list.

Module call:
```
module "schema_test" {
     source="./modules/schemes"

     schema_registry_rest_endpoint = "<endpoint>"
     schema_registry_id = "<ID>"
     schema_registry_api_key = "<API key>"
     schema_registry_api_secret = "<API Secret"

     schemes = [
         { subject = "example.subject.new", schema_file_path = "schemas/test.avsc" }
     ]
}
```

Related variable definition:
```
variable "schemas" {
  type = list(
    object({
        subject = string
        schema_file_path = string
        format = optional(string)
        compatibility = optional(string)
    })
  )
}
```

Within the module, I then iterate over the list of schemas and use them to create the `confluent_schema` resources.
We have agreed internally that we use Avro schemas which are FULL_TRANSITIVE, which is why I use format and compatibility as optional to still allow exceptions (is actually irrelevant for this case)
The compatibility is then used for the confluent_subject_config resource, which I didn't use here because I wanted to use the global compatibility level of the schema registry.


```
resource "confluent_schema" "schema" {
  for_each = { for schema in var.schemas : "${schema["subject"]}}" => schema }

  schema_registry_cluster {
    id = var.schema_registry_id
  }

  rest_endpoint = var.schema_registry_rest_endpoint
  
  subject_name = each.value["subject"]
  format = each.value["format"] != null ? each.value["format"] : "AVRO"
  schema = file(each.value["schema_file_path"])
  
  credentials {
    key    = var.schema_registry_api_key
    secret = var.schema_registry_api_secret
  }
}
```

In the first step i ran a `terraform plan` for the test.avsc schema for `example.subject.new` subject. 

Schema:
```
{
  "type": "record",
  "namespace": "example",
  "name": "example",
  "fields": [
    { "name": "fieldA", "type": "string" },
    { "name": "fieldB", "type": "int" }
  ]
}
```

Plan result:

```
Terraform will perform the following actions:

  # module.schema_test.confluent_schema.schema["example.subject.new"] will be created
  + resource "confluent_schema" "schema" {
      + format            = "AVRO"
      + id                = (known after apply)
      + rest_endpoint     = "<REST-Endpoint>"
      + schema            = jsonencode(
            {
              + fields    = [
                  + {
                      + name = "fieldA"
                      + type = "string"
                    },
                  + {
                      + name = "fieldB"
                      + type = "int"
                    },
                ]
              + name      = "example"
              + namespace = "example"
              + type      = "record"
            }
        )
      + schema_identifier = (known after apply)
      + subject_name      = "example.subject.new"
      + version           = (known after apply)

      + credentials {
          + key    = (sensitive value)
          + secret = (sensitive value)
        }

      + schema_registry_cluster {
          + id = "<SR-ID>"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

Apply log:
```
module.schema_test.confluent_schema.schema["example.subject.new"]: Creating...
module.schema_test.confluent_schema.schema["example.subject.new"]: Still creating... [10s elapsed]
module.schema_test.confluent_schema.schema["example.subject.new"]: Creation complete after 10s [id=<SR-ID>/example.subject.new/100006]
```

Result:
![image](https://user-images.githubusercontent.com/47780028/213567001-1307d606-d720-4f08-9d1a-aa0020af3115.png)

![image](https://user-images.githubusercontent.com/47780028/213567105-3243a047-1a6e-40e9-8d38-e35a949a6ebf.png)

Now i'm going to change the content of test.avsc to another schema that is not compatible to the previous one

```
{
  "type": "record",
  "namespace": "another_example",
  "name": "another_example",
  "fields": [
    {
      "name": "my_field1",
      "type": "int"
    },
    {
      "name": "my_field2",
      "type": "double"
    },
    {
      "name": "my_field3",
      "type": "string"
    }
  ]
}
```

Plan result:
```
 # module.schema_test.confluent_schema.schema["example.subject.new"] must be replaced
-/+ resource "confluent_schema" "schema" {
      ~ id                = "<SR-ID>/example.subject.new/100006" -> (known after apply)
      ~ schema            = jsonencode(
          ~ {
              ~ fields    = [
                  ~ {
                      ~ name = "fieldA" -> "my_field1"
                      ~ type = "string" -> "int"
                    },
                  ~ {
                      ~ name = "fieldB" -> "my_field2"
                      ~ type = "int" -> "double"
                    },
                  + {
                      + name = "my_field3"
                      + type = "string"
                    },
                ]
              ~ name      = "example" -> "another_example"
              ~ namespace = "example" -> "another_example"
                # (1 unchanged element hidden)
            } # forces replacement
        )
      ~ schema_identifier = 100006 -> (known after apply)
      ~ version           = 1 -> (known after apply)
        # (3 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

Apply log:
```
module.schema_test.confluent_schema.schema["example.subject.new"]: Destroying... [id=<SR-ID>/example.subject.new/100006]
module.schema_test.confluent_schema.schema["example.subject.new"]: Still destroying... [id=<SR-ID>/example.subject.new/100006, 10s elapsed]
module.schema_test.confluent_schema.schema["example.subject.new"]: Destruction complete after 10s
module.schema_test.confluent_schema.schema["example.subject.new"]: Creating...
module.schema_test.confluent_schema.schema["example.subject.new"]: Still creating... [10s elapsed]
module.schema_test.confluent_schema.schema["example.subject.new"]: Creation complete after 11s [id=<SR-ID>/example.subject.new/100007]
```

![image](https://user-images.githubusercontent.com/47780028/213568098-9d3bc68e-d6e9-410e-9fdf-34f214ba9bc6.png)

![image](https://user-images.githubusercontent.com/47780028/213568170-c5ebcafb-954f-4c1e-81e8-8778d2900e39.png)

So now I only have version 2 of a subject/schema which should be FULL_TRANSITIVE, but this version 2 is not at all compatible with version 1, which no longer exists.
But as far as I understand it for me, it should have been and I shouldn't have created this second version in the first place.

Otherwise we would be back at the point "Delete Subject to delete all versions" The UI doesn't let me add this version via the "Evolve schema" button, nor via "Add Schema" because it is recognized as incompatible.
Only when I delete this version 2 can I also add a third incompatible schema.

Maybe I take the statement "Check against which schemas -> All previous versions" too seriously, because if the schema is registered as version 2, then it should also be compatible with all previous versions.
In my opinion, that is not the case here